/**
 * UML（Unified Modeling Language，统一建模语言）类图：类、接口、继承、实现、依赖、关联、聚合、组合
 * 用于描述系统中类（对象）本身的组成和类（对象）之间的各种静态关系
 */
public class ClassDiagram {
    /**
     * 继承（Generalization）：表示一般与特殊的关系，是父类与子类之间的关系，是一种继承关系（is-a；三角实线）
     * 实现（Realization）：表示接口与实现类之间的关系，类实现了接口，类中的操作实现了接口中所声明的所有的抽象操作（三角虚线）
     * 依赖（Dependency）：某个类的方法通过局部变量、方法的参数、返回值或者对静态方法的调用来访问另一个类（被依赖类）中的某些方法（箭头虚线）
     * 关联（Association）：通常将一个类的对象作为另一个类的成员变量来实现关联关系（单向/双向；一对一/一对多/多对多；箭头实线）
     * 聚合（Aggregation）：表示部分和整体的关系，整体和部分可以分开，是一种强关联关系，具有导航型和多重性（has-a；空心菱形）
     * 组合（Composition）：表示部分和整体的关系，整体和部分不能分开，级联删除也是一种组合关系（contains-a；实心菱形）
     */
}
